codeigniter4-framework-68d1a58/app/Models/UserModel.php

    public function getBioById(int $userId): ?array
    {
        return $this->select('first_name, bio')
            ->where('id', $userId)
            ->first();
---
SELECT `first_name`, `bio`
FROM `users`
WHERE `id` = 5
 LIMIT 1

    public function updateBioById(int $userId, string $bio): array
    {
        if ($userId <= 0) return ['ok' => false, 'error' => 'Invalid session'];

        $ok = $this->where('id', $userId)
            ->set([
                'bio' => $bio,
                'updated_at' => date('Y-m-d H:i:s'),
            ])
            ->update();
---
UPDATE `users` SET `bio` = 'Un pasajero buena nota, que le gusta el rock bien pesado.', `updated_at` = '2025-12-12 03:01:05'
WHERE `id` = 5

    public function updateProfile(int $userId, array $input, $photoFile = null): array
    {
        $first_name  = trim($input['first_name'] ?? '');
        $last_name   = trim($input['last_name'] ?? '');
        $national_id = trim($input['national_id'] ?? '');
        $birth_date  = trim($input['birth_date'] ?? '');
        $email       = trim($input['email'] ?? '');
        $phone       = trim($input['phone'] ?? '');
        $pass        = (string)($input['password'] ?? '');
        $pass2       = (string)($input['password2'] ?? '');
        $currentPhoto= trim($input['current_photo'] ?? '');

        if ($userId <= 0 || $first_name==='' || $last_name==='' || $national_id==='' || $birth_date==='' || $email==='' || $phone==='') {
            return ['ok' => false, 'error' => 'Missing required fields'];
        }

        // Email único
        $exists = $this->select('id')
            ->where('LOWER(email)', strtolower($email))
            ->where('id !=', $userId)
            ->first();
---
SELECT `id`
FROM `users`
WHERE LOWER(email) = 'dylanjimenezalfaro.ml@gmail.com'
AND `id` != 5
 LIMIT 1

            $data['password_hash'] = password_hash($pass, PASSWORD_DEFAULT);
        }

        $ok = $this->update($userId, $data);
---
UPDATE `users` SET `first_name` = 'Dylan', `last_name` = 'Jimenez Alfaro', `national_id` = '208570199', `birth_date` = '2004-09-08', `email` = 'dylanjimenezalfaro.ml@gmail.com', `phone` = '87125755', `photo_path` = '/Img/users/u5_1765508481.jpg', `updated_at` = '2025-12-12 03:01:21'
WHERE `users`.`id` IN (5)