codeigniter4-framework-68d1a58/app/Controllers/AuthController.php

    public function doLogin()
    {
        $request = $this->request;

        if ($request->getMethod() !== 'POST') {
            return redirect()->to(
                site_url('login') . '?error=' . urlencode('Invalid request method')
            );
        }

        $email    = trim($request->getPost('email') ?? '');
        $password = trim($request->getPost('password') ?? '');

        if ($email === '' || $password === '') {
            return redirect()->to(
                site_url('login') . '?error=' . urlencode('Please fill in all fields.')
            );
        }

        $userModel = new UserModel();
        $user = $userModel
            ->select('id, role, status, first_name, last_name, email, password_hash')
            ->where('email', $email)
            ->first();
---
SELECT `id`, `role`, `status`, `first_name`, `last_name`, `email`, `password_hash`
FROM `users`
WHERE `email` = 'dylanjimenezalfaro.ml@gmail.com'
 LIMIT 1