codeigniter4-framework-68d1a58/app/Controllers/ProfileController.php

    public function edit()
    {
        if (!$this->requireLogin()) {
            return redirect()->to(site_url('login') . '?error=' . urlencode('Please login'));
        }

        $userId = (int) session('user_id');
        $userModel = new UserModel();

        $user = $userModel->select('id, role, status, first_name, last_name, national_id, birth_date, email, phone, photo_path')
            ->where('id', $userId)
            ->first();
---
SELECT `id`, `role`, `status`, `first_name`, `last_name`, `national_id`, `birth_date`, `email`, `phone`, `photo_path`
FROM `users`
WHERE `id` = 5
 LIMIT 1